#pragma once
#include <fstream>

namespace sdk::cached
{
	inline uintptr_t Base = 0;
	inline uintptr_t UWorld = 0;
	inline uintptr_t FreeFn = 0;
	inline uintptr_t GetNameByIndex = 0;
	inline uintptr_t LineSightOfTo = 0;
	inline uintptr_t GetBoneMatrix = 0;
	inline uintptr_t ProjectWorldToScreen = 0;

	namespace objects
	{
		//Engine Render
		inline PVOID Font = 0;
		inline PVOID K2_DrawLine = 0;
		inline PVOID K2_DrawBox = 0;
		inline PVOID K2_DrawText = 0;
		inline PVOID K2_TextSize = 0;

		//Main Functions
		inline PVOID WasInputKeyJustPressed = 0;
		inline PVOID IsInputKeyDown = 0;
		inline PVOID GetMousePosition = 0;
		inline PVOID dingus = 0;
		inline PVOID GetActorBounds = 0;
		inline PVOID K2_SetActorLocation = 0;
		inline PVOID GetMuzzleLocation = 0;
		inline PVOID GetVelocity = 0;
		inline PVOID ClientSetCameraMode = 0;
		inline PVOID SetVisibility = 0;
		inline PVOID SetWeaponVisibility = 0;
		inline PVOID SetCharacterBodyVisibilityForPossession = 0;
		inline PVOID ClientSetViewTarget = 0;
		inline PVOID GetPlatform = 0;
		inline PVOID IsDead = 0;

		//Floating
		inline PVOID StartFloating = 0;
		inline PVOID EndFloating = 0;

		//SetTimeOfDay
		inline PVOID FortKismetLibrary = 0;
		inline PVOID SetTimeOfDay = 0;

		//ConvertToFName
		inline PVOID KismetStringLibrary = 0;
		inline PVOID Conv_StringToName = 0;
	}

	namespace classes
	{
		//Actors Classes
		inline PVOID FortPlayerPawnAthena = 0;
		inline PVOID FortPickup = 0;
		inline PVOID BuildingContainer = 0;
		inline PVOID FortProjectileBase = 0;

		//Not real classes in ue4
		inline PVOID Tiered_Chest = 0;
		inline PVOID Tiered_Ammo = 0;
	}
}



namespace sdk::structs
{
	struct FMatrix
	{
		float M[ 4 ][ 4 ];
	};
	static FMatrix* myMatrix = new FMatrix( );

	template<class T>
	struct TArray
	{
		friend struct FString;

	public:
		inline TArray( )
		{
			Data = nullptr;
			Count = Max = 0;
		};

		inline int Num( ) const
		{
			return Count;
		};

		inline T& operator[]( int i )
		{
			return Data[ i ];
		};

		inline const T& operator[]( int i ) const
		{
			return Data[ i ];
		};

		inline bool IsValidIndex( int i ) const
		{
			return i < Num( );
		}

	private:
		T* Data;
		int32_t Count;
		int32_t Max;
	};

	struct FString : private TArray<wchar_t>
	{
		inline FString( )
		{
		};

		FString( const wchar_t* other )
		{
			Max = Count = *other ? utilities::custom_wcslen( other ) + 1 : 0;

			if ( Count )
			{
				Data = const_cast< wchar_t* >( other );
			}
		};

		inline bool IsValid( ) const
		{
			return Data != nullptr;
		}

		inline const wchar_t* c_str( ) const
		{
			return Data;
		}
	};

	struct FName
	{
		uint32_t ComparisonIndex;
		uint32_t DisplayIndex;
	};

	struct FKey
	{
		FName KeyName;
		unsigned char Padding_00[0x10];
	};

	struct FLinearColor
	{
		float R;
		float G;
		float B;
		float A;
	};

	struct FVector2D
	{
		float X;
		float Y;
	};

	struct FVector
	{
		float X;
		float Y;
		float Z;

		inline float getDistance(const sdk::structs::FVector cmp) {
			if (cmp.X == 0 || cmp.Y == 0 || cmp.Z == 0) return 0;

			float dx = (this->X - cmp.X);
			float dy = (this->Y - cmp.Y);
			float dz = (this->Z - cmp.Z);

			int tmp = (utilities::custom_sqrtf((dx * dx) + (dy * dy) + (dz * dz)));
			return (int)(tmp / 100);
		}
	};

	struct FRotator
	{
		float Pitch;
		float Yaw;
		float Roll;
	};

	struct FMinimalViewInfo {
		sdk::structs::FVector Location;
		sdk::structs::FRotator Rotation;
		float FOV;
		float OrthoWidth;
		float OrthoNearClipPlane;
		float OrthoFarClipPlane;
		float AspectRatio;
	};

	class FText {
	private:
		char _padding_[0x28];
		PWCHAR Name;
		DWORD Length;
	public:

		inline PWCHAR c_str() {
			return Name;
		}
	};

	struct FPawnHighlight
	{
		float                                              Priority_28_E2E1B5344846E187B9C11B863A7F0698;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
		FLinearColor                                Inner_21_4CC2801147EA190DE16F59B34F36853E;                // 0x0004(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
		FLinearColor                                Outer_22_5A1D7D0543D303E8B54B66A7F7BD2E2E;                // 0x0014(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
		float                                              FresnelBrightness_23_52B0F96447FF640F47DF2895B0602E92;    // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
		float                                              FresnelExponent_24_B427CF0C441AA37ED49833BF7579DE6D;      // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
		float                                              UsesPulse_25_E29229F64E540F0617E4C4987AD77605;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	};

	struct FViewTargetTransitionParams
	{
		float BlendTime;
		int BlendFunction;
		float BlendExp;
		bool bLockOutgoing;
	};

	enum EViewTargetBlendFunction
	{		
		VTBlend_Linear, // Camera does a simple linear interpolation.
		VTBlend_Cubic, // Camera has a slight ease in and ease out, but amount of ease cannot be tweaked.
		VTBlend_EaseIn, // Camera immediately accelerates, but smoothly decelerates into the target.  Ease amount controlled by BlendExp.
		VTBlend_EaseOut, // Camera smoothly accelerates, but does not decelerate into the target.  Ease amount controlled by BlendExp.
		VTBlend_EaseInOut, // Camera smoothly accelerates and decelerates.  Ease amount controlled by BlendExp.
		VTBlend_PreBlended, // The game's camera system has already performed the blending. Engine should not blend at all
		VTBlend_MAX,
	};

	class AHUD
	{
	public:
		unsigned char Padding_d24Be[0x228];
